Revit 2027 API
RenderingQualitySettings.RenderTime Property
 The render target time as a numerical value between 1 and 32768.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int RenderTime { get; set; }
Public Property RenderTime As Integer
	Get
	Set
public:
property int RenderTime {
	int get ();
	void set (int value);
}
member RenderTime : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is not valid RenderTime.
InvalidOperationException |  When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Remarks
 Increase this value to increase render time.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace